In [2]:
# panadas

In [2]:
import pandas as pd
import numpy as np

In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\users\dudha\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\dudha\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\dudha\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\dudha\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\dudha\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
# Serires(array,index,datatype,copy)  S is capital in Series

In [5]:
pd.Series()

C:\Users\dudha\AppData\Local\Temp\ipykernel_3224\2031691219.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series()

Series([], dtype: float64)

In [6]:
data = [6,7,11,23,45]

In [7]:
pd.Series(data)

0     6
1     7
2    11
3    23
4    45
dtype: int64

In [8]:
pd.Series(data, index = ["a","b","c","d","e"])

a     6
b     7
c    11
d    23
e    45
dtype: int64

In [9]:
data = np.array(7,8,11,45,67,89)

TypeError: array() takes from 1 to 2 positional arguments but 6 were given

In [10]:
Name = {"a":23, "b":45, "c":67, "d":90}

In [11]:
ser1 = pd.Series(Name)

In [18]:
ser1

a    23
b    45
c    67
d    90
dtype: int64

In [12]:
print(ser1[0])

23

In [13]:
ser1.iloc[0]

23

In [14]:
ser1.iloc[0:2]

a    23
b    45
dtype: int64

In [15]:
ser1.iloc[[1,3]]                 #double breaket is compulsory because iloc takes only one index

b    45
d    90
dtype: int64

In [16]:
S1 = pd.Series([5,6,7],index=["one","two","three"])

In [17]:
S2 = pd.Series([11,12,13],index=["a","b","c"])

In [18]:
S2.iloc[0] + S2.iloc[0]                         # single data addition

22

In [19]:
S1.iloc[1:] + S2.iloc[0:2]                      # index names are different

a       NaN
b       NaN
three   NaN
two     NaN
dtype: float64

In [20]:
S3 = pd.Series([5,6,7],index=["one","two","three"])
S4 = pd.Series([11,12,13],index=["one","two","three"])

In [21]:
S3.iloc[1:] + S4.iloc[0:2]                    # range is not same

one       NaN
three     NaN
two      18.0
dtype: float64

In [22]:
S3.iloc[0:2] + S4.iloc[0:2]                   # we have to give same range and index name to add

one    16
two    18
dtype: int64

In [23]:
S1([S1>10])

TypeError: 'Series' object is not callable

In [24]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [25]:
dataframe = pd.DataFrame([11,67,89,34,56])

In [26]:
dataframe

    0
0  11
1  67
2  89
3  34
4  56

In [27]:
data= {"Name":["Dhruv","Chinmay","Kush","Uchit","Dev"], "Age":[21,20,18,21,22]}

In [28]:
dataframe1 = pd.DataFrame(data)

In [29]:
dataframe1

      Name  Age
0    Dhruv   21
1  Chinmay   20
2     Kush   18
3    Uchit   21
4      Dev   22

In [30]:
data1 = [["Dhruv",21],["Vraj",20],["Ayushi",19]]

In [31]:
data1 = pd.DataFrame(data,columns = ["Name","Rollno"],index = ["a","b","c"])

ValueError: Length of values (5) does not match length of index (3)

In [ ]:
data1

In [32]:
data = pd.DataFrame({"One":pd.Series([11,56,34,89]),"Two":pd.Series([34,67,89])})

In [33]:
data

   One   Two
0   11  34.0
1   56  67.0
2   34  89.0
3   89   NaN

In [34]:
data = pd.DataFrame({"One":pd.Series([11,56,34,89],index=["a","b","c","d"]),"Two":pd.Series([34,67,89],index=["a","b","c"])})

In [35]:
data

   One   Two
a   11  34.0
b   56  67.0
c   34  89.0
d   89   NaN

In [36]:
data.index         # returns indexs

#RangeIndex(start=0, stop=4, step=1)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [37]:
data.columns      # returns columns

Index(['One', 'Two'], dtype='object')

In [38]:
data.head()  # first 5 records by default

   One   Two
a   11  34.0
b   56  67.0
c   34  89.0
d   89   NaN

In [39]:
data.tail(2)  # last 2 records

   One   Two
c   34  89.0
d   89   NaN

In [43]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   One     4 non-null      int64
 1   Two     3 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 96.0+ bytes

In [45]:
data.describe()

             One        Two
count   4.000000   3.000000
mean   47.500000  63.333333
std    33.211444  27.682726
min    11.000000  34.000000
25%    28.250000  50.500000
50%    45.000000  67.000000
75%    64.250000  78.000000
max    89.000000  89.000000